{
    "title": "English-Portuguese Advanced Sentences",
    "langA-B": ["en", "pt"],
    "lessons": [
        {
            "A": "Had she known the truth, she would have acted differently.",
            "B": "Se ela soubesse a verdade, teria agido de forma diferente.",
            "noiseA": "soubessem soubesseis agir",
            "noiseB": ""
        },
        {
            "A": "He had scarcely arrived when the storm broke.",
            "B": "Mal ele havia chegado quando a tempestade irrompeu.",
            "noiseA": "malhar chegadoes tempestivamente",
            "noiseB": ""
        },
        {
            "A": "Were it not for the ongoing strikes, the economy would be thriving.",
            "B": "Não fossem as greves em curso, a economia estaria a prosperar.",
            "noiseA": "fossemos grevistas prosperado",
            "noiseB": ""
        },
        {
            "A": "She wishes she hadn't given up on her dreams so easily.",
            "B": "Ela queria não ter desistido dos seus sonhos tão facilmente.",
            "noiseA": "queriam desisti fácil",
            "noiseB": ""
        },
        {
            "A": "They might have been planning a surprise, had we not interfered.",
            "B": "Eles poderiam ter estado a planear uma surpresa, não tivéssemos nós interferido.",
            "noiseA": "poderiam planejar interferimos",
            "noiseB": ""
        },
        {
            "A": "Lest he forget, remind him of the meeting.",
            "B": "Para que ele não se esqueça, lembre-o da reunião.",
            "noiseA": "esquecer esqueçam lembra",
            "noiseB": ""
        },
        {
            "A": "No sooner had I shut my eyes than the phone rang.",
            "B": "Assim que fechei os olhos, o telefone tocou.",
            "noiseA": "assimilar toques feches",
            "noiseB": ""
        },
        {
            "A": "But for your timely intervention, the project would have failed.",
            "B": "Se não fosse a sua intervenção oportuna, o projeto teria falhado.",
            "noiseA": "fosseis oportunos falhariam",
            "noiseB": ""
        },
        {
            "A": "It's high time they addressed the underlying issues.",
            "B": "Já é mais do que tempo de eles abordarem as questões subjacentes.",
            "noiseA": "abordar questõesse submeterem",
            "noiseB": ""
        },
        {
            "A": "Raramente nos deparamos com tais percepções profundas.",
            "B": "Seldom do we encounter such profound insights.",
            "noiseA": "deparas profundo profundas",
            "noiseB": ""
        },
        {
            "A": "However much it rains, the field remains dry.",
            "B": "Por mais que chova, o campo continua seco.",
            "noiseA": "howevered rained dried",
            "noiseB": ""
        },
        {
            "A": "If only he had come to the party.",
            "B": "Oxalá ele tivesse vindo à festa.",
            "noiseA": "only coming partied",
            "noiseB": ""
        },
        {
            "A": "While he strove, she gave up.",
            "B": "Ao passo que ele se esforçava, ela desistia.",
            "noiseA": "strives giving gaveup",
            "noiseB": ""
        },
        {
            "A": "Notwithstanding his promise, he didn't show up.",
            "B": "Não obstante a sua promessa, ele não apareceu.",
            "noiseA": "notwithstandingly promised shown",
            "noiseB": ""
        },
        {
            "A": "Would to God the truth were revealed.",
            "B": "Prouvera a Deus que a verdade fosse revelada.",
            "noiseA": "wouldst truthful revealing",
            "noiseB": ""
        },
        {
            "A": "He acted as if nothing had happened, but his disturbance was evident.",
            "B": "Ele agiu como se nada tivesse acontecido, mas era evidente a sua perturbação.",
            "noiseA": "happenings disturbingly evidenced",
            "noiseB": ""
        },
        {
            "A": "Perhaps, a solution to the dilemma will be found.",
            "B": "Porventura, encontrar-se-á uma solução para o dilema.",
            "noiseA": "possibly finding solving",
            "noiseB": ""
        },
        {
            "A": "Be that as it may, the decision has already been made.",
            "B": "Seja como for, a decisão já foi tomada.",
            "noiseA": "being making decided",
            "noiseB": ""
        },
        {
            "A": "Indeed, the situation is more complex than it appears.",
            "B": "Deveras, a situação é mais complexa do que aparenta.",
            "noiseA": "indubitably situations appeared",
            "noiseB": ""
        },
        {
            "A": "It is necessary that everyone collaborates for the project's success.",
            "B": "Mister se faz que todos colaborem para o sucesso do projeto.",
            "noiseA": "necessitates everyone's successful",
            "noiseB": ""
        }
    ]
}
